In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.read_csv(r'I:\Text Datasets\CSV\titanic.csv')

In [3]:
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

### 1- Show Version of Pandas

In [ ]:
pd.__version__
pd.show_versions()

### 2 - Creating DataFrame

In [ ]:
data=dict(LN=[1,2,3,4,5],RN=[5,2,6,3,2])
df1=pd.DataFrame(data)
df2=pd.DataFrame(data=np.random.rand(4,4),columns=list('abcd'))
df3=pd.DataFrame({'NICE':[1,5,2,5,7,8],'GOOD':[1,3,2,34,4,6]})

### 3 - Rename Columns

In [ ]:
df.head()
df.rename(columns={'LN':'IIIIIII','RN':'OOOOOOOOOO'})
df.add_prefix('_Y')
df.add_suffix('_X')
name_list=['Power','Shower','Nower','Khawer','OOO','LLLLL','KKKKKKK']
df=pd.read_csv('I:\\Text Datasets\\CSV\\drinks.csv',names=name_list)
df.columns=df.columns.str.replace('Shower','NAI')

In [ ]:
df.head()

### 4 - Reverse Row Order

In [ ]:
df=pd.read_csv('I:\\Text Datasets\\CSV\\drinks.csv')
df.head()

In [ ]:
df.loc[::-1].head()
df.sort_index(ascending=False).tail()

### 5 - Reverse Columns Order

In [ ]:
df.loc[:,df.columns[::-1]].head()
df.loc[:,::-1].head()

### 6 - Select Data with Datatype

In [ ]:
df.head()

In [ ]:
df.select_dtypes('int64')
df.select_dtypes('number')
df.select_dtypes('float64')
df.select_dtypes(include=['int64','number','float64','object'])
df.select_dtypes(exclude=['int64','number','float64'])

### 7 - Converting String to Numbers

In [ ]:
df['BS']=df.beer_servings.astype(str)

In [ ]:
df.BS.sum()

In [ ]:
df['BS']=df.BS.astype(np.int64)
df['BS'].apply(np.float64).sum()
pd.to_numeric(df.BS,errors='coerce').fillna(0).sum()

### 8 - Reduce Dataframe Size

In [ ]:
df=pd.read_csv('I:\\Text Datasets\\CSV\\drinks.csv')
df.info(memory_usage=True)

In [ ]:
req_columns=['country','continent']
df=pd.read_csv('I:\\Text Datasets\\CSV\\drinks.csv',usecols=req_columns)
df.info(memory_usage=True)

In [ ]:
dtypes={'continent':'category'}
df=pd.read_csv('I:\\Text Datasets\\CSV\\drinks.csv',usecols=req_columns,dtype=dtypes)
df.info(memory_usage=True)

### 9 - Build a DataFrame from Multiple Files (row-wise)

In [ ]:
df1=pd.read_csv('I:\\Text Datasets\\CSV\\drinks.csv')
df2=pd.read_csv('I:\\Text Datasets\\CSV\\drinks.csv')
df3=pd.read_csv('I:\\Text Datasets\\CSV\\drinks.csv')
files=[df1,df2,df3]
pd.concat((file for file in files),ignore_index=True)

### 10 - Build a DataFrame from Multiple Files (colum-wise)

In [ ]:
df1=df1.loc[:,['country','beer_servings','spirit_servings']]
df2=df2.loc[:,['wine_servings','continent']]

In [ ]:
data=[df1,df2]
pd.concat((file for file in data),axis=1)

### 11 - Create a Dataframe from Clipboard

In [ ]:
# first we have to copy data from Excel sheet then use it as it as
df=pd.read_clipboard()
df.head()

### 12 - Split a Dataframe into two random subsets

In [ ]:
df=pd.read_csv('I:\\Text Datasets\\CSV\\movie_users.csv')
movie1=df.sample(frac=0.75,random_state=1234)
movie2=df.drop(movie1.index)

### 13 - Filter a Dataframe with Multiple Catigories

In [ ]:
df=pd.read_csv('I:\\Text Datasets\\CSV\\movie_users.csv')
df.head()

In [ ]:
df[df.genre.isin(['Crime','Action','Comedy'])].head()
df[~df.genre.isin(['Crime','Action','Comedy'])].head()

### 14 - Filter a Dataframe with largest Catigories

In [ ]:
df=pd.read_csv('I:\\Text Datasets\\CSV\\movie_users.csv')
df.head()

In [ ]:
df[df.genre.isin(df.genre.value_counts().index[0:3].tolist())].sample(5)
count=df.genre.value_counts()
count.nlargest(3)

### 15 - Handle Missing Values

In [ ]:
df=pd.read_table('I:\\Text Datasets\\CSV\\film.csv',encoding='latin',sep=';',skiprows=0)
df.head()

In [ ]:
df.drop(0,axis=0).dropna(thresh=len(df)*0.2,axis=0).isna().sum()

### 16 - Split a String into Multiple Columns

In [ ]:
df.drop(0,axis=0,inplace=True)

In [ ]:
df.head()

In [ ]:
df1=pd.DataFrame()
df[['A','B']]=df.Director.str.split(',',n=1,expand=True)

### 17 - Expand a Series of lists into Dataframe

In [ ]:
df=pd.DataFrame({'A':[1,2,3,4],'B':[[1,2,3],[1,23],[1,1,1,4],[1,45,65]]})

In [ ]:
df1=df.B.apply(pd.Series)
pd.concat([df,df1],axis=1)

### 18 -  Agregate by Multiple Functions

In [ ]:
df=pd.read_csv('I:\\Text Datasets\\CSV\\movie_users.csv')
df.head()

In [ ]:
df.star_rating.agg(['min','max','mean','count'])
df.groupby('genre').star_rating.agg(['sum','count','max','min']).head()

### 19 - Combine the Output of Agrigate funtion with a Dataframe

In [ ]:
df['SUM_RATING']=df.groupby('content_rating').star_rating.transform('sum')

In [ ]:
df.head()

### 20 - Select a Slice of Rows and  Columns

In [ ]:
df=pd.read_csv('I:\\Text Datasets\\CSV\\titanic.csv')
df.head(3)

In [ ]:
df.describe().loc['min':'max','Survived':'Age']

### 21 - Reshape a MultiIndexed Series

In [ ]:
df[df.Survived==1].groupby(['Age','Pclass']).Survived.count().unstack().head()

### 22 - Create a Pivot Table

In [ ]:
df.head(2)

In [ ]:
pd.pivot_table(df,index='Sex',values='Survived',columns='Pclass',aggfunc=['sum','mean'],margins=True)

### 23 -  Converting Continious Data into Catigorical Data

In [ ]:
df.head(2)

In [ ]:
df['Age']=pd.cut(df.Age,bins=[0,18,25,40],labels=['child','young adult','adult'])

In [ ]:
df.head(2)

### 24 - Change Display Options

In [ ]:
pd.set_option('display.max_colwidth',100)

In [ ]:
df.head()

In [ ]:
pd.reset_option('display.max_colwidth')

### 25 -  Style a Dataframe

In [3]:
df=pd.read_csv('I:\\Text Datasets\\CSV\\yahoo_finance.csv')
df.head()

         Date      Open      High       Low     Close  Adj Close     Volume
0  2004-08-19  2.250714  2.275714  2.168571  2.193571   1.966391   97230000
1  2004-08-20  2.193571  2.213571  2.177857  2.200000   1.972154   79195200
2  2004-08-23  2.204286  2.233572  2.185714  2.220000   1.990082   63665000
3  2004-08-24  2.232857  2.282143  2.227857  2.282143   2.045789   93534000
4  2004-08-25  2.276428  2.367857  2.266428  2.360714   2.116223  126404600

In [40]:
format_dict={'Open':'${:.2f}','High':'{:,}'}

In [67]:
# df.style.format(formatter=format_dict).hide_index().background_gradient(subset='Open',cmap='Blues')

In [66]:
# df.style.format(formatter=format_dict).highlight_min('High','Green').hide_index()

### 26 -  Getting Max and Min Values index of Specific Column

In [72]:
def min_max_observation(col):
    
    top=df[col].idxmax()
    df1=pd.DataFrame(data=df.loc[top])
    
    bottom=df[col].idxmin()
    df2=pd.DataFrame(data=df.loc[bottom])
    
    return pd.concat([df1,df2],axis=1)

min_max_observation('Age')

,630,803
PassengerId,631,804
Survived,1,1
Pclass,1,3
Name,"Barkworth, Mr. Algernon Henry Wilson","Thomas, Master. Assad Alexander"
Sex,male,male
Age,80,0.42
SibSp,0,0
Parch,0,1
Ticket,27042,2625
Fare,30,8.5167
Cabin,A23,NaN
Embarked,S,C

In [75]:
df.groupby("Sex").size()

Sex
female    314
male      577
dtype: int64

In [5]:
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [9]:
emp_df=pd.DataFrame()
emp_df['First'],emp_df['Second']=df.Age,df.Fare